Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/moving_country/asylum_seekers_and_refugees/the_asylum_process_in_ireland/refugees_asylum_seekers_introduction.html.txt.tmx
Source language: en
Languages: ga

source: Coming to Ireland as an asylum seeker or refugee
ga: Ag teacht go hÉirinn mar iarrthóir tearmainn nó mar dhídeanaí

source: The term refugee is commonly used to describe a number of categories of people. These categories of people may have different legal statuses and as a result of these different legal statuses, they may have varying rights and obligations
ga: Úsáidtear an téarma dídeanaí sa ghnáthchaint chun cur síos ar roinnt catagóirí daoine a d’fhéadfadh stádais éagsúla dlíthiúla a bheith acu agus a d’fhéadfadh cearta agus oibleagáidí athraitheacha a bheith acu dá bharr sin, ach a bhfuil baint acu go léir leis an bpróiseas na dteifeach mar a shainmhínítear i ndlí na hÉireann é agus é bunaithe ar choinbhinsiún idirnáisiúnta

source: All of these people are linked to the international protection process as defined in Irish law and based on international convention
ga: An 30 Meitheamh 2015, d’fhoilsíodh an Rialtas an Tuarascáil ná Meitheal um Próiseas Cosanta, Soláthar Díreach agus tacaíochtaí d’iarrthóirí tearmainn san áireamh

source: Under Section 2 of the Act, a person who qualifies for international protection is “a person who is either—
ga: Soláthraíonn an tAcht um Chosaint Idirnáisiúnta 2015

source: (a) a refugee and in relation to whom a refugee declaration is in force, or
ga: • Nós imeachta iarratais aonair ar chosaint a chur isteach ina gcorpraítear na hiarratais ar stádas dídeanaithe, fhochosaint agus chead chun fanacht

source: (b) a person eligible for subsidiary protection and in relation to whom a subsidiary protection declaration is in force”
ga: • Aistreofar próiseáil iarratas cosanta ón Oifig an Choimisinéara Iarratais do Dhídeanaithe chuig an Roinn Dlí agus Cirt agus Comhionannais

source: Irish Refugee Protection Programme
ga: Clár Cosaint Dídeanaí na hÉireann

source: The Government is introducing the Irish Refugee Protection Programme that will provide international protection for up to 4,000 people
ga: Tugann an Rialtas isteach Clár Cosaint Dídeanaí na hÉireann a sholáthróidh cosaint idirnáisiúnta do 4,000 duine

source: A network of emergency and orientation centres will be established where assessments and decisions on refugee status will be made
ga: Beidh líonra ionaid éigeandála agus measúnaithe bunaithe sna háiteanna a dhéanfar measúnaithe agus cinntí le haghaidh stádas dídeanaí

source: An asylum seeker is a person who seeks to be recognised as a refugee under the terms of the 1951 Convention relating to the Status of Refugees as defined in Section 2 of the International Protection Act 2015
ga: Is duine é an t-iarrthóir tearmainn a lorgaíonn aitheantas mar dhídeanaí faoi réir théarmaí Choinbhinsiún na bliana 1951 a bhaineann le Stádas na nDídeanaí mar a shainmhínítear in san Acht na nDídeanaithe 1996, arna leasaithe

source: The Act introduces a new term “applicant” but, for clarity, we will continue to use the term “asylum seeker” as well. Under Section 2 of the Act, the legal definition of a refugee is a person who, "owing to a well-founded fear of being persecuted for reasons of race, religion, nationality, political opinion or membership of a particular social group, is outside his or her country of nationality and is unable or, owing to such fear, is unwilling to avail himself or herself of the protection of that country, or a stateless person, who, being outside of the country of former habitual residence for the same reasons as mentioned above, is unable or, owing to such fear, unwilling to return to it"
ga: Faoin Alt 2 is an sainmhíniú dlíthiúil de dhídeanaí é duine a bhíonn, "de bharr údar maith eagla de ghéarleanúint orthu mar gheall ar chúiseanna ciníochais, creidimh, náisiúntachta, ballraíochta de ghrúpa áirithe sóisialta nó tuairime polaitiúla, go mbíonn siad lasmuigh de thír a náisiúntachta agus nach féidir, nó de thoradh na heagla sin, nach bhfuil toilteanach cosaint na tíre sin a fháil dóibh féin; nó nach bhfuil náisiúntacht acu agus iad lasmuigh dá ngnáthionad cónaithe roimhe sin, nach féidir nó, de bharr na heagla sin, nach bhfuil toilteanach chun filleadh uirthi"

source: A Convention refugee is a person who fulfills the requirements of the definition of a refugee under the terms of the Geneva Convention relating to the status of refugees as defined in the International Protection Act 2015 and who is granted refugee status
ga: Is duine é an dídeanaí coinbhinsiúin a chomhlíonann riachtanais sainmhínithe an teifigh faoi théarmaí Choinbhinsiún na Ginéive i ndáil le stádas na ndídeanaí mar a shainmhínítear in Acht na nDídeanaithe 1996 é; agus ar a mbronntar stádas dídeanaí

source: A Programme refugee is a person who has been invited to Ireland under a Government decision in response to a humanitarian request, usually from the United Nations High Commissioner for Refugees (UNHCR), either for the purposes of temporary protection or resettlement
ga: Is duine é an dídeanaí cláir ar tugadh cuireadh go hÉirinn dó faoi chinneadh Rialtais mar fhreagairt ar iarratas daonnachtúil, a thagann de ghnáth ó Ard-Choimisinéir na Náisiún Aontaithe do Theifigh (UNHCR), chun críoch na cosanta sealadaí nó an athlonnaithe

source: Section 2 of the International Protection Act 2015 defines a person eligible for subsidiary protection as someone “who does not qualify as a refugee in respect of whom substantial grounds have been shown for believing that he or she, if returned to his or her country of origin, would face a real risk of suffering serious harm and who is unable or, owing to such risk, unwilling to avail himself or herself of the protection of that country”
ga: Faoi Rialacháin an Aontais Eorpaigh (Cosaint Choimhdeach) 2013, is é is duine atá incháilithe do chosaint choimhdeach, duine “nach gcáilíonn mar dhídeanaí, ar léirigh bunúis shubstainteacha ina leith go gcreidtear gur fíorbhaol don duine sin, dá bhfillfeadh sé/sí ar a t(h)ír dhúchais, agus go mbeadh sé/sí thíos le díobháil thromchúiseach agus nach bhfuil in ann nó, de dheasca an bhaoil sin, nach bhfuil toiliúil cosaint na tíre sin a fháil.”

source: Under section 49 of the International Protection Act 2015, if an applicant is not given either a refugee declaration or a subsidiary protection declaration, the Minister for Justice and Equality may consider whether they should be given permission to remain in the State
ga: Aon duine nach gcomhlíonann go hiomlán riachtanais sainmhínithe na ndídeanaí faoi théarmaí Choinbhinsiún na Ginéive a bhaineann le stádas na ndídeanaí mar a shainmhínítear in Acht na nDídeanaithe 1996 é; féadfar cead chun fanacht sa Stát a bhronnadh orthu

source: When making this decision, the Minister will have regard to the applicant’s family and personal circumstances along with other matters, including the applicant’s connection to the State and humanitarian considerations
ga: Féadfar cead chun fanacht a bhronnadh ar náisiúnaigh neamh-AE ar diúltaíodh iad a dhearbhú mar dhídeanaithe, freisin, agus nach bhfuil i dteideal fochosanta. Cá háit a dhéanfaidh mé iarratais?
